Repository: common-repository/spyoutube
Catalog: languages/spYouTube-*.po
Languages: fi_fi

source: VideoID is empty
fi_fi: VideoID on tyhj&auml;

source: Username is empty
fi_fi: K&auml;ytt&auml;j&auml;tunnus on tyhj&auml;

source: Rating your own videos is not permitted.
fi_fi: Et voi pisteytt&auml;&auml; omia videoitasi.

source: Insert
fi_fi: Liit&auml;

source: Rating could only be shown for your own videos
fi_fi: Voit n&auml;ytt&auml;&auml; vain omien videoidesi pisteet.

source: Manage videos
fi_fi: Videoiden hallinta

source: Upload video
fi_fi: Videon lataus

source: Settings
fi_fi: Asetukset

source: Video deleted
fi_fi: Video poistettu

source: Video could not be deleted. Reason:
fi_fi: Videota ei voi poistaa. Syy:

source: Video edited
fi_fi: Videota muokattu

source: Upload new video
fi_fi: Lataa uusi video

source: Screenshot
fi_fi: Kuvakaappaus

source: Title
fi_fi: Otsikko

source: Category
fi_fi: Aihe

source: Description
fi_fi: Kuvaus

source: Tags
fi_fi: Avainsanat

source: Duration
fi_fi: Kesto

source: Comments
fi_fi: Kommentit

source: Rating
fi_fi: Pisteet

source: Updated
fi_fi: P&auml;ivitetty

source: ratings
fi_fi: Pisteet

source: View
fi_fi: Katsele

source: Edit
fi_fi: Muokkaa

source: Delete
fi_fi: Poista

source: Edit video
fi_fi: Muokkaa videota

source: Cancel editing
fi_fi: Peru muokkaus

source: Embedding
fi_fi: Liit&auml; merkint&auml;&auml;n

source: Embed video
fi_fi: Liit&auml; video

source: Optional parameter
fi_fi: Lis&auml;asetukset

source: Embed all videos
fi_fi: Liit&auml; kaikki videot

source: Video successfully committed
fi_fi: Video liitetty

source: ClientID or Developer Key empty. Please check your settings. Without these, you can not upload any video.
fi_fi: AsiakasID tai Kehitt&auml;j&auml;n avain on tyhj&auml;. Ole hyv&auml; ja tarkista asetuksesi. Ilman n&auml;it&auml; tunnuksia et voi ladata videoita.

source: Select your category
fi_fi: Valitse aihe

source: Title of the video
fi_fi: Videon otsikko

source: Tags (comma sperated)
fi_fi: Avainsanat (erota pilkulla)

source: Your video
fi_fi: Omat videot

source: Uploading... Please wait
fi_fi: Ladataan... Ole hyv&auml; ja odota

source: Cancel
fi_fi: Peru

source: Settings saved
fi_fi: Asetukset tallennettu

source: YouTube username
fi_fi: YouTube-k&auml;ytt&auml;j&auml;tunnus

source: Your username for YouTube
fi_fi: K&auml;ytt&auml;j&auml;tunnuksesi YouTube-palveluun

source: YouTube password
fi_fi: YouTube-salasana

source: Your password for YouTube
fi_fi: Salasanasi YouTube-palveluun

source: Google Client ID
fi_fi: Google Asiakas-ID

source: No Client ID yet? Get it here:
fi_fi: Ei viel&auml; Asiakas-ID:t&auml;? Klikkaa t&auml;h&auml;n:

source: Google developer ID
fi_fi: Google Kehitt&auml;j&auml;-ID

source: No developer ID yet? Get it here:
fi_fi: Ei viel&auml; Kehitt&auml; j&auml;-ID:t&auml;? Klikkaa t&auml;h&auml;n:

source: Save Changes
fi_fi: Tallenna muutokset
